{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report mapping splash screen and Tailwind animation features to their source files and components.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to short descriptive summaries of their functionality.",
  "frontend/index.css": "Tailwind base/style definitions with CSS variables for themes and global element styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React landing page including header, hero, content sections, and the SplashOverlay component.",
  "frontend/src/components/SplashOverlay.tsx": "Fullscreen animated splash logo that plays a pop animation then fades out, respecting reduced-motion settings.",
  "frontend/src/components/TestimonialsCarousel.tsx": "Interactive testimonials carousel with navigation and star ratings.",
  "frontend/src/content/rates.ts": "Exports predefined rate option objects with tiers, features, and pricing placeholders.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor, refetching on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for handling Internet Identity login, logout, and identity state management.",
  "frontend/src/index.css": "Defines Tailwind layers, custom OKLCH theme variables for light/dark modes, base typography, and reduced‑motion handling for splash animation.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity provider, importing global styles and rendering App.",
  "frontend/tailwind.config.js": "Configures Tailwind with plugins, custom colors mapped to CSS variables, extended animations, keyframes, shadows, and container settings.",
  "project_state.json": "Stores project metadata, existing features, and pending feature requests related to the splash animation and Tailwind utilities."
}